; ModuleID = 'Arduino/HardwareSerial.cpp'
source_filename = "Arduino/HardwareSerial.cpp"
target datalayout = "e-p:16:16:16-i8:8:8-i16:16:16-i32:32:32-i64:64:64-f32:32:32-f64:64:64-n8"
target triple = "avr-atmel-none"

%class.HardwareSerial = type <{ %class.Stream, i8*, i8*, i8*, i8*, i8*, i8*, i8, i8, i8, i8, i8, [64 x i8], [64 x i8] }>
%class.Stream = type { %class.Print, i32, i32 }
%class.Print = type { i32 (...)**, i16 }

$_ZTS6Stream = comdat any

$_ZTI6Stream = comdat any

@_ZTV14HardwareSerial = unnamed_addr constant [8 x i8*] [i8* null, i8* bitcast ({ i8*, i8*, i8* }* @_ZTI14HardwareSerial to i8*), i8* bitcast (i16 (%class.HardwareSerial*, i8)* @_ZN14HardwareSerial5writeEh to i8*), i8* bitcast (i16 (%class.Print*, i8*, i16)* @_ZN5Print5writeEPKhj to i8*), i8* bitcast (i16 (%class.HardwareSerial*)* @_ZN14HardwareSerial9availableEv to i8*), i8* bitcast (i16 (%class.HardwareSerial*)* @_ZN14HardwareSerial4readEv to i8*), i8* bitcast (i16 (%class.HardwareSerial*)* @_ZN14HardwareSerial4peekEv to i8*), i8* bitcast (void (%class.HardwareSerial*)* @_ZN14HardwareSerial5flushEv to i8*)], align 1
@_ZTVN10__cxxabiv120__si_class_type_infoE = external global i8*
@_ZTS14HardwareSerial = constant [17 x i8] c"14HardwareSerial\00"
@_ZTS6Stream = linkonce_odr constant [8 x i8] c"6Stream\00", comdat
@_ZTI5Print = external constant i8*

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 4.0.0 (trunk 289351) (llvm/trunk 289369)", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, enums: !2, retainedTypes: !3)
!1 = !DIFile(filename: "Arduino/HardwareSerial.cpp", directory: "/Users/dylan/projects/llvm-project/standalone-arduino")
!2 = !{}
!3 = !{!4, !9, !10, !11}
!4 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !5, size: 16)
!5 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !6)
!6 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint8_t", file: !7, line: 126, baseType: !8)
!7 = !DIFile(filename: "/Applications/Arduino.app/Contents/Java/hardware/tools/avr/avr/include/stdint.h", directory: "/Users/dylan/projects/llvm-project/standalone-arduino")
!8 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!9 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !7, line: 128, baseType: !10)
!10 = !DIBasicType(name: "unsigned int", size: 16, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "rx_buffer_index_t", file: !12, line: 64, baseType: !6)
!12 = !DIFile(filename: "Arduino/HardwareSerial.h", directory: "/Users/dylan/projects/llvm-project/standalone-arduino")
!13 = !{i32 2, !"Dwarf Version", i32 4}
!14 = !{i32 2, !"Debug Info Version", i32 3}
!15 = !{!"clang version 4.0.0 (trunk 289351) (llvm/trunk 289369)"}
!16 = distinct !DISubprogram(name: "serialEventRun", linkageName: "_Z14serialEventRunv", scope: !1, file: !1, line: 63, type: !17, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: true, unit: !0, variables: !2)
!17 = !DISubroutineType(types: !18)
!18 = !{null}
!19 = !DILocation(line: 66, column: 25, scope: !20)
!20 = distinct !DILexicalBlock(scope: !16, file: !1, line: 66, column: 7)
!21 = !DILocation(line: 66, column: 43, scope: !22)
!22 = !DILexicalBlockFile(scope: !20, file: !1, discriminator: 2)
!23 = !DILocation(line: 66, column: 7, scope: !24)
!24 = !DILexicalBlockFile(scope: !16, file: !1, discriminator: 2)
!25 = !DILocation(line: 66, column: 64, scope: !26)
!26 = !DILexicalBlockFile(scope: !20, file: !1, discriminator: 3)
!27 = !DILocation(line: 77, column: 1, scope: !16)
!28 = distinct !DISubprogram(name: "_tx_udr_empty_irq", linkageName: "_ZN14HardwareSerial17_tx_udr_empty_irqEv", scope: !29, file: !1, line: 81, type: !67, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: true, unit: !0, declaration: !99, variables: !102)
!29 = distinct !DICompositeType(tag: DW_TAG_class_type, name: "HardwareSerial", file: !12, line: 93, size: 1256, elements: !30, vtableHolder: !100, identifier: "_ZTS14HardwareSerial")
!30 = !{!31, !34, !36, !37, !38, !39, !40, !41, !43, !45, !46, !49, !50, !54, !55, !59, !63, !66, !69, !73, !74, !75, !76, !77, !82, !85, !89, !92, !95, !98, !99}
!31 = !DIDerivedType(tag: DW_TAG_inheritance, scope: !29, baseType: !32, flags: DIFlagPublic)
!32 = !DICompositeType(tag: DW_TAG_class_type, name: "Stream", file: !33, line: 49, size: 96, flags: DIFlagFwdDecl, identifier: "_ZTS6Stream")
!33 = !DIFile(filename: "Arduino/Stream.h", directory: "/Users/dylan/projects/llvm-project/standalone-arduino")
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_ubrrh", scope: !29, file: !12, line: 96, baseType: !35, size: 16, offset: 96, flags: DIFlagProtected)
!35 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_ubrrl", scope: !29, file: !12, line: 97, baseType: !35, size: 16, offset: 112, flags: DIFlagProtected)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_ucsra", scope: !29, file: !12, line: 98, baseType: !35, size: 16, offset: 128, flags: DIFlagProtected)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_ucsrb", scope: !29, file: !12, line: 99, baseType: !35, size: 16, offset: 144, flags: DIFlagProtected)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_ucsrc", scope: !29, file: !12, line: 100, baseType: !35, size: 16, offset: 160, flags: DIFlagProtected)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_udr", scope: !29, file: !12, line: 101, baseType: !35, size: 16, offset: 176, flags: DIFlagProtected)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_written", scope: !29, file: !12, line: 103, baseType: !42, size: 8, offset: 192, flags: DIFlagProtected)
!42 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_rx_buffer_head", scope: !29, file: !12, line: 105, baseType: !44, size: 8, offset: 200, flags: DIFlagProtected)
!44 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !11)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_rx_buffer_tail", scope: !29, file: !12, line: 106, baseType: !44, size: 8, offset: 208, flags: DIFlagProtected)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_tx_buffer_head", scope: !29, file: !12, line: 107, baseType: !47, size: 8, offset: 216, flags: DIFlagProtected)
!47 = !DIDerivedType(tag: DW_TAG_volatile_type, baseType: !48)
!48 = !DIDerivedType(tag: DW_TAG_typedef, name: "tx_buffer_index_t", file: !12, line: 59, baseType: !6)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_tx_buffer_tail", scope: !29, file: !12, line: 108, baseType: !47, size: 8, offset: 224, flags: DIFlagProtected)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_rx_buffer", scope: !29, file: !12, line: 113, baseType: !51, size: 512, offset: 232, flags: DIFlagProtected)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 512, elements: !52)
!52 = !{!53}
!53 = !DISubrange(count: 64)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_tx_buffer", scope: !29, file: !12, line: 114, baseType: !51, size: 512, offset: 744, flags: DIFlagProtected)
!55 = !DISubprogram(name: "HardwareSerial", scope: !29, file: !12, line: 117, type: !56, isLocal: false, isDefinition: false, scopeLine: 117, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !4, !4, !4, !4, !4, !4}
!58 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 16, flags: DIFlagArtificial | DIFlagObjectPointer)
!59 = !DISubprogram(name: "begin", linkageName: "_ZN14HardwareSerial5beginEm", scope: !29, file: !12, line: 121, type: !60, isLocal: false, isDefinition: false, scopeLine: 121, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!60 = !DISubroutineType(types: !61)
!61 = !{null, !58, !62}
!62 = !DIBasicType(name: "long unsigned int", size: 32, encoding: DW_ATE_unsigned)
!63 = !DISubprogram(name: "begin", linkageName: "_ZN14HardwareSerial5beginEmh", scope: !29, file: !12, line: 122, type: !64, isLocal: false, isDefinition: false, scopeLine: 122, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!64 = !DISubroutineType(types: !65)
!65 = !{null, !58, !62, !6}
!66 = !DISubprogram(name: "end", linkageName: "_ZN14HardwareSerial3endEv", scope: !29, file: !12, line: 123, type: !67, isLocal: false, isDefinition: false, scopeLine: 123, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!67 = !DISubroutineType(types: !68)
!68 = !{null, !58}
!69 = !DISubprogram(name: "available", linkageName: "_ZN14HardwareSerial9availableEv", scope: !29, file: !12, line: 124, type: !70, isLocal: false, isDefinition: false, scopeLine: 124, containingType: !29, virtuality: DW_VIRTUALITY_virtual, virtualIndex: 2, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!70 = !DISubroutineType(types: !71)
!71 = !{!72, !58}
!72 = !DIBasicType(name: "int", size: 16, encoding: DW_ATE_signed)
!73 = !DISubprogram(name: "peek", linkageName: "_ZN14HardwareSerial4peekEv", scope: !29, file: !12, line: 125, type: !70, isLocal: false, isDefinition: false, scopeLine: 125, containingType: !29, virtuality: DW_VIRTUALITY_virtual, virtualIndex: 4, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!74 = !DISubprogram(name: "read", linkageName: "_ZN14HardwareSerial4readEv", scope: !29, file: !12, line: 126, type: !70, isLocal: false, isDefinition: false, scopeLine: 126, containingType: !29, virtuality: DW_VIRTUALITY_virtual, virtualIndex: 3, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!75 = !DISubprogram(name: "availableForWrite", linkageName: "_ZN14HardwareSerial17availableForWriteEv", scope: !29, file: !12, line: 127, type: !70, isLocal: false, isDefinition: false, scopeLine: 127, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!76 = !DISubprogram(name: "flush", linkageName: "_ZN14HardwareSerial5flushEv", scope: !29, file: !12, line: 128, type: !67, isLocal: false, isDefinition: false, scopeLine: 128, containingType: !29, virtuality: DW_VIRTUALITY_virtual, virtualIndex: 5, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!77 = !DISubprogram(name: "write", linkageName: "_ZN14HardwareSerial5writeEh", scope: !29, file: !12, line: 129, type: !78, isLocal: false, isDefinition: false, scopeLine: 129, containingType: !29, virtuality: DW_VIRTUALITY_virtual, virtualIndex: 0, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
!78 = !DISubroutineType(types: !79)
!79 = !{!80, !58, !6}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !81, line: 62, baseType: !10)
!81 = !DIFile(filename: "/Users/dylan/projects/builds/llvm/bin/../lib/clang/4.0.0/include/stddef.h", directory: "/Users/dylan/projects/llvm-project/standalone-arduino")
!82 = !DISubprogram(name: "write", linkageName: "_ZN14HardwareSerial5writeEm", scope: !29, file: !12, line: 130, type: !83, isLocal: false, isDefinition: false, scopeLine: 130, flags: DIFlagPublic | DIFlagPrototyped, isOptimized: true)
